Autodesk.Revit.DB.CurtainCell.CurveLoops
The cell boundaries on the reference face. The boundaries can have more than one CurveLoop. Each item in the returned array represents a CurveLoop containing 3 or more than 3 edges.

Autodesk.Revit.DB.CurtainCell.PlanarizedCurveLoops
The planarized curve loops for cell boundaries. The boundaries can have more than one CurveLoop. Each item in the returned array represents a CurveLoop containing 3 or more than 3 edges.

Autodesk.Revit.DB.CurtainCell
Represents a CurtainCell within Autodesk Revit.